Mandatory1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       34680;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       34700;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       34720;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35200;
        startFace       35720;
    }
)

// ************************************************************************* //
